; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation3 - direction
	Star6 - direction
	Star1 - direction
	Star5 - direction
	Star2 - direction
	Star4 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 thermograph2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon18)
)
(:goal (and
	(pointing satellite0 Star1)
	(pointing satellite1 Star8)
	(have_image Star8 thermograph1)
	(have_image Planet9 infrared0)
	(have_image Star10 infrared0)
	(have_image Planet11 infrared0)
	(have_image Phenomenon12 thermograph2)
	(have_image Star13 thermograph2)
	(have_image Planet14 infrared0)
	(have_image Planet15 thermograph2)
	(have_image Star16 thermograph1)
	(have_image Phenomenon17 thermograph2)
	(have_image Phenomenon18 thermograph2)
))

)

; plan
1. (turn_to satellite1 star4 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 star4)
   goals met: 0 of 13
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 13
3. (calibrate satellite1 instrument2 star4)
   added: (calibrated instrument2)
   goals met: 0 of 13
4. (turn_to satellite1 phenomenon18 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon18)
   goals met: 0 of 13
5. (take_image satellite1 phenomenon18 instrument2 thermograph2)
   added: (have_image phenomenon18 thermograph2)
   goals met: 1 of 13
6. (turn_to satellite1 phenomenon17 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon17)
   goals met: 1 of 13
7. (take_image satellite1 phenomenon17 instrument2 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon12 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 13
9. (turn_to satellite0 star1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star1)
   goals met: 3 of 13
10. (take_image satellite1 phenomenon12 instrument2 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 4 of 13
11. (turn_to satellite1 planet11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet11)
   goals met: 4 of 13
12. (take_image satellite1 planet11 instrument2 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 5 of 13
13. (turn_to satellite1 planet14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet14)
   goals met: 5 of 13
14. (take_image satellite1 planet14 instrument2 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 6 of 13
15. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 6 of 13
16. (take_image satellite1 planet15 instrument2 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 7 of 13
17. (turn_to satellite1 planet9 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet9)
   goals met: 7 of 13
18. (take_image satellite1 planet9 instrument2 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 8 of 13
19. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 8 of 13
20. (take_image satellite1 star10 instrument2 infrared0)
   added: (have_image star10 infrared0)
   goals met: 9 of 13
21. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 9 of 13
22. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 9 of 13
23. (turn_to satellite1 star2 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star2)
   goals met: 9 of 13
24. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 9 of 13
25. (turn_to satellite1 star13 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star13)
   goals met: 9 of 13
26. (take_image satellite1 star13 instrument1 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 10 of 13
27. (turn_to satellite1 star16 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star16)
   goals met: 10 of 13
28. (take_image satellite1 star16 instrument1 thermograph1)
   added: (have_image star16 thermograph1)
   goals met: 11 of 13
29. (turn_to satellite1 star8 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star8)
   goals met: 12 of 13
30. (take_image satellite1 star8 instrument1 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 13 of 13
